{
    "courses": [
        {
            "name": "JavaScript. Уровень 1. Интерактивные веб-приложения",
            "description": "Данный курс предназначен для тех, кто уже знаком с принципами HTML-вёрстки и созданием статичных страниц. Практические знания и навыки, приобретённые на этом уровне, дают возможность работать и создавать динамические веб-страницы и приложения. Курс систематизирует знания студентов, которые уже сталкивались с JavaScript, но не имеют богатого опыта работы с языком .",
            "source": "https://geekbrains.ru/courses/6",
            "employee_level": "Junior"
        },
        {
            "name": "Практический JavaScript (Продвинутый уровень)",
            "description": "Этот курс направлен на практическое применение языка программирования JavaScript на реальных проектах. Вы получаете реальное техническое задание, исходные файлы и мы на практике учимся выполнять такие проекты до самого конца.",
            "source": "https://www.udemy.com/course/javascript_practice/",
            "employee_level": "Middle"
        },
        {
            "name": "Асинхронная разработка на JS",
            "description": "Прокачка асинхронности от и до. Промисы, Async/Await, Генераторы.",
            "source": "https://ru.hexlet.io/tracks/js-asynchronous-programming",
            "employee_level": "Senior"
        },
        {
            "name": "HTML/CSS. Интерактивный курс",
            "description": "HTML/CSS - язык гипертекстовой разметки, основа для изучения серверных ЯП. Изучив HTML, вы сможете создать адаптивную веб-страничку или веб-сайт. CSS - каскадные таблицы стилей - позволит оформить сверстанный сайт так, как вам хочется. Вы сможете смотреть видеокурс в удобное время и по всем вопросам обращаться к наставнику, который будет контролировать ваш прогресс. Формат располагает к общению и самодисциплине в обучении. За месяц вы научитесь: * верстке адаптивных сайтов, * валидной кроссбраузерной вёрстке, * flexbox вёрстке, * выполнению базовых операций в Figma, * использованию препроцессоров SASS и Bootstrap. Для перехода к следующему занятию курса необходимо, чтобы ваше домашнее задание прошло проверку. Это покажет, что вы поняли предыдущий урок и легко освоите новые знания. Задание может проверить как ментор, так и одногруппники, знаниям которых вы доверяете, и получить за это ачивку. С каждой проверкой количество ачивок растет, а навык работы с чужим кодом увеличивается. От количества ачивок зависит уровень итогового сертификата: чем их больше, тем выше статус. Эта в чем-то игровая механика делает занятия еще интереснее.",
            "source": "https://geekbrains.ru/courses/1309",
            "employee_level": "Junior"
        },
        {
            "name": "HTML5 и CSS3. Современные средства Web-разработки",
            "description": "Основа веб-технологии – это HTML/CSS. Это базовый фундамент, который служит основой для создания современных веб-сайтов и является первым этапом для изучения других технологий программирования для глобальной сети Internet. Любая значимая организация имеет своё представление в глобальной сети. Это требование времени и требование рынка. Без учета современных реалий мира невозможно добиться конкурентоспособности и следовательно успеха. Именно связка HTML/CSS даёт возможность верстать макеты, создавать и редактировать статические сайты. Изучаемая на данном курсе технология программирования позволяет заложить долгосрочную основу и закрепиться в данной области на рынке труда.",
            "source": "https://geekbrains.ru/courses/9",
            "employee_level": "Junior"
        },
        {
            "name": "Веб-вёрстка",
            "description": "Вы познакомитесь со стандартами Web 2.0, научитесь работать с макетами и форматировать код, освоите адаптивную верстку, а по итогу — сможете создавать быстрые и удобные сайты, которые точно понравятся пользователям.",
            "source": "https://skillbox.ru/course/weblayout/",
            "employee_level": "Junior"
        },
        {
            "name": "CSS: Позиционирование",
            "description": "Расположение элементов на странице - это обширная тема со множеством нюансов. Их возможно учесть зная фундаментальные правила CSS и способы управления потоком документов внутри HTML-разметки. Данный курс шаг за шагом через практику, раскрывает базовые принципы позиционирования элементов.",
            "source": "https://ru.hexlet.io/courses/css-positioning",
            "employee_level": "Middle"
        },
        {
            "name": "CSS: Адаптивность",
            "description": "Курс посвящён адаптивности — главному элементу сайта. Адаптивная вёрстка позволяет комфортно просматривать макеты на многих устройствах: мобильных телефонах, планшетах, компьютерных мониторах. В этом курсе раскроются механизмы создания адаптированной HTML-разметки с использованием популярных механизмов CSS. В конце курса вы узнаете об мощном инструменте — медиазапросах, с помощью которых возможно добавлять CSS-стили для разных разрешений и типов экрана.",
            "source": "https://ru.hexlet.io/courses/css-adaptive",
            "employee_level": "Senior"
        },
        {
            "name": "Git. Базовый курс. Основы работы с Git.",
            "description": "В течение 13 роликов мы познакомимся с основами системы контроля версий Git. Выясним, почему она важна в современной разработке и коллективном программировании. Познакомимся с основными понятиями Git: репозиториями, коммитами, ветками и тэгами. Изучим базовые операции: создание и клонирование репозитория, слияние веток, запрос истории изменений и многое другое. Посмотрим, как при помощи Git сдавать домашние задания. Это базовый курс, после него можно приступать к изучению любого языка программирования. Кроме того, вы будете готовы к прохождению собеседования, где несколько вопросов обычно посвящены системе контроля версий.",
            "source": "https://geekbrains.ru/courses/1117",
            "employee_level": "Junior"
        },
        {
            "name": "JavaScript-фреймворк React.js",
            "description": "React.js — один из самых популярных фреймворков в мире. Вы научитесь создавать изоморфные приложения на React Redux, типизировать их с помощью Typescript и работать с различными публичными сервисами.",
            "source": "https://skillbox.ru/course/react-js/",
            "employee_level": "Junior"
        },
        {
            "name": "Vue.js",
            "description": "Vue.js — один из самых популярных фреймворков в мире. Вы научитесь создавать сайты и приложения на Vue, работать с библиотекой Vuex и интегрироваться с API — и станете более востребованным специалистом.",
            "source": "https://skillbox.ru/course/vue-js/",
            "employee_level": "Junior"
        },
        {
            "name": "Как быстро начать использовать JavaScript-фреймворк Vue.js",
            "description": "Курс для начинающих веб-разработчиков, которые знакомы с JavaScript, но никогда не использовали фреймворк.",
            "source": "https://www.udemy.com/course/javascript-vuejs/",
            "employee_level": "Junior"
        },
        {
            "name": "JS: Redux (React)",
            "description": "Redux — это официальный способ управлять состоянием в нетривиальных React приложениях. Несмотря на свою простоту и элегантность, он требует время на вникание. Кроме того, вокруг Redux огромная экосистема библиотек, автоматизирующих разные задачи. Этот курс посвящен в том числе самым популярным библиотекам.",
            "source": "https://ru.hexlet.io/courses/js-redux",
            "employee_level": "Middle"
        },
        {
            "name": "Node.js",
            "description": "Node.js расширяет возможности языка JavaScript и выступает в роли веб-сервера. С помощью этой платформы вы научитесь создавать полноценные веб-приложения и CLI-утилиты — и сможете вырасти как разработчик.",
            "source": "https://skillbox.ru/course/nodejs/",
            "employee_level": "Junior"
        },
        {
            "name": "Node JS. Практический курс. (Mongo, GraphQL, MySQL, Express)",
            "description": "Серверная разработка на JavaScript и очень основательный разбор взаимосвязи пользовательской части с сервером на двух реальных примерах. В курсе предоставлена информация от самых основ, от установки самого NodeJS, до деплоя готового приложения и размещения его на сервере",
            "source": "https://www.udemy.com/course/nodejs-full-guide/",
            "employee_level": "Middle"
        },
        {
            "name": "Курс bootstrap",
            "description": "Bootstrap - это популярный CSS фреймворк для создания сайтов. С помощью Bootstrap Вы научитесь верстать сайты быстро и эффективно, благодаря применению готовых компонентов фреймворка. В видеокурсе Вы изучите основы адаптивной верcтки на BOOTSTRAP с нуля и примените знания полученные в уроках на практике. Создавайте верстку собственных сайтов с применением Bootstrap в 5 раз быстрее!",
            "source": "https://beonmax.com/courses/bootstrap/",
            "employee_level": "Junior"
        },
        {
            "name": "Программист PHP от GeekBrains",
            "description": "Курс, рассчитанный на новичков. По его завершении пользователь сможет создавать приложения, программы, динамические и статические сайты. Занятия ведут профессионалы, которые до сих пор занимаются практическим программированием на PHP. Основной упор делается на практических заданиях с обязательной проверкой.",
            "source": "https://geekbrains.ru/professions/php_developer?utm_source=admitad&utm_medium=cpa&utm_campaign=admitad&utm_content=courses&utm_term=14/09/2017&partner_id=admitad&click_id=ca630e5d547da1dcae0bde97d4a0a7c7&sub_id=129852",
            "employee_level": "Junior"
        },
        {
            "name": "SQL и получение данных",
            "description": "Вы научитесь с помощью SQL получать данные из БД, фильтровать, агрегировать, а также импортировать и экспортировать.",
            "source": "https://netology.ru/programs/sql-lessons?utm_source=yandex&utm_medium=cpc&utm_campaign=bds_sql_ou_ya_search&utm_content=6773295638&utm_term=курсы sql&yclid=5307990286190017212&stop=1#/",
            "employee_level": "Junior"
        },
        {
            "name": "Администрирование PostgreSQL 10. Базовый курс",
            "description": "Какие навыки будут получены: общие сведения об архитектуре PostgreSQL, установка, базовая настройка, управление сервером, организация данных на логическом и физическом уровнях, базовые задачи администрирования, управление пользователями и доступом, представление о резервном копировании и репликации.",
            "source": "https://postgrespro.ru/education/courses/DBA1",
            "employee_level": "Junior"
        },
        {
            "name": "Администрирование PostgreSQL 10. Настройка и мониторинг",
            "description": "Настройка различных конфигурационных параметров исходя из понимания внутренней организации сервера, мониторинг сервера с использованием обратной связи для итеративной настройки параметров, настройки, связанные с локализацией, управление расширениями и знакомство с процедурой обновления сервера.",
            "source": "https://postgrespro.ru/education/courses/DBA2",
            "employee_level": "Middle"
        },
        {
            "name": "Курс MySQL c нуля",
            "description": "В процессе обучения MySQL с нуля вы узнаете, что включено в понятие реляционной базы данных, как правильно составлять запрос и прочие тонкости языка SQL.",
            "source": "https://webshake.ru/php-i-mysql-s-nulya",
            "employee_level": "Junior"
        },
        {
            "name": "Понятный видеокурс по основам ООП",
            "description": "Этот курс поможет понять инкапсуляцию и полиморфизм, а также расскажет о базовых шаблонах проектирования – как раз, если давно хотели освежить знания ООП.",
            "source": "https://proglib.io/p/oop-video-course/",
            "employee_level": "Junior"
        },
        {
            "name": "Linux с нуля до Сертификата",
            "description": "Чему вы научитесь: научитесь запускать виртуалные машины на Windows; устанавливать Linux; пользоваться Linux на хорошем уровне; писать Bash скрипты на Linux.",
            "source": "https://www.udemy.com/course/linux-lpi",
            "employee_level": "Junior"
        },
        {
            "name": "1С-Битрикс. Администратор. Базовый",
            "description": "Курс предназначен для базовой подготовки администраторов сайтов, созданных на \"1С-Битрикс: Управление сайтом\". Изучив курс, вы освоите основные методы администрирования системы.",
            "source": "https://dev.1c-bitrix.ru/learning/course/index.php?COURSE_ID=35",
            "employee_level": "Junior"
        },
        {
            "name": "1С-Битрикс. Многосайтовость",
            "description": "Требуются новые ресурсы, освещающие различные сферы деятельности, имеющие разные цели, решающие разные задачи: информационные, имиджевые/представительские, торговые, коммуникативные. Каждый отдельный проект, имеющий конкретную цель удобнее вести и продвигать в Сети.",
            "source": "https://www.1c-bitrix.by/products/cms/multisite.php",
            "employee_level": "Middle"
        },
        {
            "name": "1С-Битрикс. Многосайтовость. Масштабирование",
            "description": "Масштабирование сервера позволяет добиться отказоустойчивой системы в условиях возрастающей нагрузки.",
            "source": "https://dev.1c-bitrix.ru/learning/course/?COURSE_ID=48&CHAPTER_ID=06644&LESSON_PATH=3918.4635.6644",
            "employee_level": "Senior"
        },
        {
            "name": "Jenkins",
            "description": "На данном курсе вы познакомитесь с основами работы с Jenkins и научитесь написанию простых заданий для сборки (job) и заданий для непрерывной доставки и развертывания (pipeline). После прохождения курса, вы сможете на практике создавать рабочие сценарии для сборки ваших проектов и деплоя приложений на рабочие сервера. ",
            "source": "https://itvdn.com/ru/video/jenkins",
            "employee_level": "Senior"
        },
        {
            "name": "Создание SOAP Web-сервиса",
            "description": "Этот урок освещает пошаговое создание сервера SOAP web-сервиса с использованием Spring.",
            "source": "https://spring-projects.ru/guides/producing-web-service/",
            "employee_level": "Senior"
        },
        {
            "name": "Веб сервисы SOAP и RESTful",
            "description": "В этом курсе вы научитесь всему, что нужно знать про веб сервисы на Java: как использовать спецификации JAX-WS и JAX-RS, как использовать REST и SOAP сервисы, как безопасно передавать данные, как сжимать данные, как создавать клиентов, как расширять свое приложение, и многое другое ...",
            "source": "https://coursehunter.net/course/veb-servisy-soap-i-restful",
            "employee_level": "Middle"
        },
        {
            "name": "Создание RESTful Web-сервиса",
            "description": "Вы создадите сервис, который будет принимать HTTP GET запросы, а ответом будет JSON строка.",
            "source": "https://spring-projects.ru/guides/rest-service/",
            "employee_level": "Senior"
        },
        {
            "name": "Курс «Разработчик на Spring Framework» от Otus",
            "description": "После окончания курса вы сможете: использовать возможности Spring в разработке, создавать сервис-ориентированную архитектуру, создавать масштабируемые приложения, работать с БД и запросами через проекты Spring, работать с технологиями вспомогательных проектов.",
            "source": "https://otus.ru/lessons/javaspring",
            "employee_level": "Junior"
        },
        {
            "name": "Основы командной строки",
            "description": "Чему вы научитесь: выполнять навигацию по файловой системе; работать с переменными окружения; разбираться с доступами к файлам; использовать пакетный менеджер для установки утилит; выходить из Vim'a.",
            "source": "https://ru.hexlet.io/courses/cli-basics",
            "employee_level": "Junior"
        },
        {
            "name": "Java. Уровень 1. Язык программирования Java",
            "description": "Вы научитесь программировать на языке Java, создавать с его помощью простые приложения. А также получите представление о Java-технологиях для взаимодействия с СУБД и создания Web-приложений.",
            "source": "https://www.specialist.ru/course/dzhv1-a",
            "employee_level": "Junior"
        },
        {
            "name": "Java. Уровень 2. Разработка клиент - серверных приложений",
            "description": "Пройдя данный курс, вы получите знания, необходимые для создания реальных Java-приложений класса клиент-сервер. Делается акцент на раскрытии наиболее существенных сторон создания клиентских и серверных приложений. Многочисленные примеры делают изложенный материал весьма наглядным и помогают его лучшему усвоению. Серьезное внимание уделяется компонентам JavaBeans для создания повторно используемых программных компонентов и сборочного программирования.",
            "source": "https://www.specialist.ru/course/dzhv2-a",
            "employee_level": "Middle"
        },
        {
            "name": "jQuery. Основы",
            "description": "Данный курс будет полезен всем, кто знаком с основами языка JavaScript и желает научиться использовать данный фреймворк для создания собственных скриптов или изменения уже существующих.",
            "source": "https://webformyself.com/category/premium/javascript-premium/jquerypremium/",
            "employee_level": "Junior"
        },
        {
            "name": "jQuery для профессионалов",
            "description": "О селекторах, их использовании и сравнении с чистым JavaScript",
            "source": "https://geekbrains.ru/courses/389",
            "employee_level": "Middle"
        },
        {
            "name": "Основы MongoDB",
            "description": "Курс «Основы MongoDB» состоит из 6 логически взаимосвязанных уроков, на которых учащиеся познакомятся с основными концепциями работы с MongoDB в среде NodeJS. 7 урок является кратким руководством применения MongoDB в .NET приложениях. На данном курсе учащиеся познакомятся с понятием «документо-ориентированная база данных», узнают основные различия между реляционными и нереляционными базами данных. Научатся работать с MongoDB сервером, администрировать его. Приобретут знания о том, как работать из различных языков программирования с Mongo посредством драйвера. Узнают об уникальной возможности для NoSQL решений – транзакциях в MongoDB.",
            "source": "https://coursehunter.net/course/osnovy-mongodb",
            "employee_level": "Junior"
        },
        {
            "name": "React JS. Практический Курс 2020",
            "description": "Фундаментальная теория. Вы получите исчерпывающую теорию по React, к которой сможете возвращаться при необходимости. Здесь собрано все, что",
            "source": "https://www.udemy.com/course/react-2020-complete-guide",
            "employee_level": "Junior"
        },
        {
            "name": "Python: основы и применение",
            "description": "В этом курсе вы узнаете фундаментальные принципы языка Python: как интерпретатор исполняет код, где он хранит переменные и данные, как определяются свои собственные типы данных и функции — на всё это мы приоткроем завесу тайны.",
            "source": "https://stepik.org/course/512",
            "employee_level": "Junior"
        },
        {
            "name": "Курс по фреймворку Symfony",
            "description": "Symfony - это пример хорошего кода. Ну, скажем, не такого плохого, как в других фреймворках. Да, он непростой, но чем выше вы ставите задачу, тем быстрее вы растёте. В этом курсе вы познакомитесь с важными компонентами фреймворка, среди которых ORM Doctrine, шаблонизатор Twig, аннотации, Dependency Injection, Routing, Security, HttpFoundation и многие другие. Курс рассчитан на крепких новичков в разработке, хорошо понимающих ООП (на уровне композиции и агрегации, задач интерфейсов и абстрактных классов), работу пространств имён и композера, работу HTTP протокола и прочие основы веба.",
            "source": "https://webshake.ru/symfony-course",
            "employee_level": "Junior"
        },
        {
            "name": "Видеокурс по Docker",
            "description": "Комплексный видеокурс по Docker, в котором мы разберем все его инструменты: от основных абстракций до параметров сети, нюансов работы с различными ОС и языками программирования. Вы познакомитесь с технологией и поймете, где и как лучше использовать Docker. Также поделимся best practice кейсами.",
            "source": "https://slurm.io/docker-videocourse",
            "employee_level": "Middle"
        },
        {
            "name": "Framework Laravel",
            "description": "Курс для PHP-разработчиков, которые: работают с ООП-парадигмой, но неуверенно чувствуют себя в вопросах разработки на базе фреймворков; хотят сократить свое время работы над задачами; имеют опыт работы с фреймворками и хотят подробнее изучить Laravel; хотят улучшить свои технические скиллы и перейти на следующий профессиональный уровень",
            "source": "https://otus.ru/lessons/laravel",
            "employee_level": "Junior"
        },
        {
            "name": "Курс по Angular",
            "description": "Этот онлайн-курс посвящён профессиональной разработке веб-приложений с помощью Angular. Цели курса: Быстро и качественно начать создавать приложения с использованием современного Angular; Отлаживать уже существующие приложения и проводить их улучшение; Научиться использовать ряд вспомогательных библиотек, часто дополняющих Angular.",
            "source": "https://learn.javascript.ru/courses/angular",
            "employee_level": "Junior"
        },
        {
            "name": "Интенсив по \"продвинутой\" разработке на Angular",
            "description": "Для тех, кто уже разрабатывает на Ангулар, но хочет развиваться дальше. Цель интенсива - лучше понять, как работает Angular, как быстрее разрабатывать и качественннее оптимизировать существующие приложения.",
            "source": "https://learn.javascript.ru/courses/angularpro",
            "employee_level": "Middle"
        },
        {
            "name": "Backbone Tutorial: Learn Backbonejs from Scratch",
            "description": "Курс предлагает вам пошаговое обучение Backbone от уровня новичка до маститого разработчика. Вы изучите все, что нужно для создания реальных приложений, начав с изучения структурных блоков Backbone и того, как они друг с другом работают. Лекции очень лаконичные и точные, чтобы вы не тратили время на воду. После каждой лекции вы получаете краткую шпаргалку по пройденному материалу и мини-проект или задание для закрепления знаний на практике.",
            "source": "https://inbenefit.com/курсы-backbone-js/",
            "employee_level": "Junior"
        },
        {
            "name": "Learning BackboneJS Testing",
            "description": "Изучение процесса тестирования приложений на Backbone.js.",
            "source": "https://www.udemy.com/course/learning-backbonejs-testing",
            "employee_level": "Middle"
        },
        {
            "name": "Курс по Gulp",
            "description": "Данный видеокурс подойдёт для тех, кто уже знаком с основами JavaScript, Git, Terminal. Gulp является менеджером задач (task runner). Gulp помогает автоматизировать выполнение типичных задач веб-разработчика: запуск препроцессоров, минификация файлов, создание спрайтов и ещё множество рутинных задач.",
            "source": "https://coursehunter.net/course/kurso-po-gulp",
            "employee_level": "Middle"
        },
        {
            "name": "Интенсив. Сборка. Gulp 4, SCSS и шаблонизатор PUG",
            "description": "За 5 дней ты освоишь Gulp, начнешь использовать сборку в своей работе. Научишься структурировать свой CSS и HTML код, использовать CSS препроцессор SCSS и шаблонизатор PUG, применять в верстке переменные, миксины, подключаемые секции, шаблоны и разделять верстку и контент. Сможешь брать на фрилансе заказы в которых фигурирует gulp сборка, препроцессоры и шаблонизатор PUG.",
            "source": "https://coursehunter.net/course/intensiv-sborka-gulp-4-scss-i-shablonizator-pug",
            "employee_level": "Senior"
        },
        {
            "name": "Продвинутый курс по Webpack v4",
            "description": "Продвинутый и ёмкий курс. Вы изучите все возможные темы, которые относятся к Webpack: от основ эффективной сборки проекта до продвинутых подходов типа code splitting и shimming. Мы подразумеваем, что вы не знакомы с Webpack, но хотите освоить его и другие технологии, используемые в продакшене на современных проектах. Для облегчения обучения доступно техническое skype-собеседование, которое выявит пробелы в знаниях и поможет их закрыть. Мы предоставим вам весь материал по курсу, чтобы вы в своём ритме занимались изучением Webpack. Доступна ежедневная менторская поддержка в чате курса. С сильной менторской поддержкой.",
            "source": "https://lectrum.io/course/webpack",
            "employee_level": "Junior"
        },
        {
            "name": "WebPack 4+",
            "description": "В данном курсе вы создадите приложение, в котором будут показана реализация всех базовых и часто используемых задач при современной веб разработке: модульность, компиляция препроцессоров, компиляция TypeScript, работа с React jsx, Babel, локальный сервер для разработки, работа с любым типом файлов и два режима сборки проекта.",
            "source": "https://webformyself.com/category/premium/javascript-premium/webpackpremium/",
            "employee_level": "Middle"
        },
        {
            "name": "Уроки Ajax",
            "description": "За курс мы изучим технологию Ajax и научимся передавать данные с клиентской стороны на серверную.  Мы создадим несколько проектов и настроим передачу данных в асинхронном формате.",
            "source": "https://itproger.com/course/ajax",
            "employee_level": "Junior"
        },
        {
            "name": "WebGL w/ Unity: The Ultimate Guide to Games in the Browser",
            "description": "Unity3D is the easiest way to deploy HTML5 games! (Easier than three.js, babylon.js, phaser and playcanvas!)",
            "source": "https://www.udemy.com/course/webgl-with-unity-the-ultimate-guide-to-games-in-the-browser/",
            "employee_level": "Middle"
        },
        {
            "name": "Препроцессор Less",
            "description": "Курс \"Препроцессор Less\" научит решать прикладные задачи, выделяя 2 часа в день. Он подходит для веб-разработчиков, желающих овладеть инструментом ускорения вёрстки. Уже в первой части обучения ученики начинают разработку своей библиотеки визуальных компонентов, осваивают световые схемы создания элементов интерфейса. Во втором блоке изучается работа с примесями, создание и использование циклов с примерами практического решения типовых задач вёрстки. В ходе обучения предусмотрены 38 заданий и 6 испытаний. Диплом не выдаётся.",
            "source": "https://htmlacademy.ru/courses/less",
            "employee_level": "Senior"
        },
        {
            "name": "Курс LESS Упрощение CSS",
            "description": "Курс по Less, это уже следующий уровень изучения стилей для сайта. Данный препроцессор делает работу с CSS очень удобной и продуктивной. Он ускоряет написание кода стилей для сайта, добавляя различные полезные фичи, такие как переменные, миксины, расширение правил и т.п. С помощью курса по Less, скорость написания кода возрастает в разы, при этом делая код более понятным и красивым. Твой код станет максимально легким для браузера, а как мы знаем, это очень важно в оптимизации.",
            "source": "https://htmllessons.ru/c/show/9",
            "employee_level": "Middle"
        },
        {
            "name": "SASS: Основы",
            "description": "С развитием технологий и сложности макетов возникла потребность в автоматизации написания CSS свойств. Наличие цветовых схем и дополнительных значений, которые определяют значения свойств выявили сложности при разработке. Чтобы избавиться от рутины и превратить написание CSS в процесс, похожий на программирование были придуманы препроцессоры — специальные языки, которые компилировались в CSS. Они позволяют создавать переиспользуемый CSS код, использовать переменные и расширить возможности написания CSS. В этом курсе вы изучите основы препроцессора SASS, который позволит в короткие сроки писать поддерживаемый и удобный CSS ко",
            "source": "https://ru.hexlet.io/courses/css-sass",
            "employee_level": "Middle"
        },
        {
            "name": "SASS: Программирование",
            "description": "Курс программирования на SASS является логическим продолжением курса SASS: основы. Помимо расширения CSS и переиспользования стилей препроцессоры добавили конструкции, доступные в других языках программирования: создание функций, использование циклов и условных конструкций. Это позволило разработчикам снизить количество кода и при этом добавить функциональность, недоступную при написании CSS. В этом курсе вы шаг за шагом изучите возможности препроцессора SASS в области программирования.",
            "source": "https://ru.hexlet.io/courses/sass-programming",
            "employee_level": "Senior"
        },
        {
            "name": "Продвинутый курс по Redis",
            "description": "Вы изучите все возможные темы, которые относятся к redis: от первоначальных шагов по установке и настройки redis до продвинутых техник по работе с данными. Мы подразумеваем, что вы не знакомы с redis, но хотите освоить его c нуля, Для облегчения обучения доступно техническое skype-собеседование, которое выявит пробелы в знаниях и поможет их закрыть.",
            "source": "https://lectrum.io/course/redis",
            "employee_level": "Junior"
        },
        {
            "name": "C#-разработчик",
            "description": "Научитесь создавать сайты, серверные приложения и десктопные приложения с помощью языка C# от Microsoft.",
            "source": "https://skillfactory.ru/csharp",
            "employee_level": "Junior"
        },
        {
            "name": "Фреймворк YII2 с Нуля до Профи",
            "description": "Yii2 позволяет быстро и качественно поднимать сайты почти любоей сложности, благодаря своей простоте и быстродействию он упростит вашу разработку в разы, а просит он только лишь базовое знание PHP взамен от вас. Скажете звучит слишком фантастически ? Нет! Просмотрев этот курс, вы сами увидете что Yii2 простой, как два пальца об асфальт.Не хотите писать сайт с нуля, а использовать Yii2 в какой то cms? Не проблема. Подключайте фреймворк к Wordpress или joomla/drupal и продолжайте независимую разработку уже с помощью yii2.",
            "source": "https://coursehunter.net/course/webformyself-yii2",
            "employee_level": "Junior"
        },
        {
            "name": "Python-фреймворк Django",
            "description": "Вы научитесь верстать веб-страницы, писать и оптимизировать веб-приложения на Django, продолжите развиваться в IT-индустрии и станете более востребованным разработчиком.",
            "source": "https://skillbox.ru/course/django-framework",
            "employee_level": "Junior"
        },
        {
            "name": "Продвинутый видеокурс по Redux",
            "description": "Вы изучите все возможные темы, которые относятся к Redux: от основ эффективного хранения и управления состоянием до подходов прототипирования архитектуры полноценного приложения и продвинутого тестирования. Мы обучим вас современным продвинутым технологиям Redux Saga и WebSocket.",
            "source": "https://lectrum.io/course/redux",
            "employee_level": "Junior"
        },
        {
            "name": "Интенсив по TypeScript",
            "description": "TypeScript увеличивает эффективность и надёжность JavaScript-разработки добавлением типизации. Он взят за основу в некоторых современных фреймворках, таких как Angular. Но, если посмотреть на тенденции современной разработки, TypeScript активно используется и с другими фреймворками и окружениями, включая React, Vue и даже Node.js. За время наших встреч мы детально изучим реальное использование TypeScript, на практике посмотрим как решать типичные проблемы. Начнем с написания простых функций и компонентов, научимся настраивать окружение, поговорим про системы сборки. А закончим приложением на TypeScript.",
            "source": "https://learn.javascript.ru/courses/typescript",
            "employee_level": "Middle"
        },
        {
            "name": "Oracle Database 12c R2: Введение в SQL",
            "description": "Пятидневный курс является хорошим введением в технологии баз данных для будущих администраторов, разработчиков, аналитиков. Курс позволяет получить практические навыки использования стандартных конструкций языка SQL и мощных расширений языка, предложенных корпорацией Oracle. Курс обеспечивает базовыми знаниями SQL, позволяющими писать запросы к одной или нескольким таблицам, модифицировать данные таблиц и создавать объекты базы данных",
            "source": "https://www.masterlab.ru/course/oracle/9558.html",
            "employee_level": "Junior"
        },
        {
            "name": "Oracle Database: Основы языка PL/SQL",
            "description": "Двухдневный курс \"Основы языка PL/SQL\" знакомит слушателей с возможностями процедурного программирования при работе с данными и помогает им оценить преимущества языка PL/SQL. Курс предназначен для разработчиков, специалистов сопровождения и администраторов БД, обладающих базовыми навыками использования языка SQL. Прослушав курс, студенты научатся создавать блоки PL/SQL кода, которые могут использоваться различными формами, отчетами и приложениями по обработке данных. Для разработки программ используется графическая среда SQL Developer.",
            "source": "https://www.masterlab.ru/course/oracle/9559.html",
            "employee_level": "Middle"
        },
        {
            "name": "Oracle Database : Программирование на языке PL/SQL",
            "description": "Пятидневный курс \"Прогнозирование на языке PL/SQL\" предназначен для разработчиков, специалистов сопровождения и администраторов БД, обладающих базовыми навыками использования языка SQL. В первой части курса излагаются стандартные конструкции PL/SQL как процедурного языка программирования: условные конструкции, циклы, блоки, объявления переменных, обработка исключительных ситуаций. Слушатели курса научатся разрабатывать, выполнять и управлять хранимыми программными единицами PL/SQL, такими как: процедуры, функции, пакеты и триггеры базы данных. Курс создан для версии 12с R2, но почти полностью применим для версий Oracle Database с 11g по 19с.",
            "source": "https://www.masterlab.ru/course/oracle/9561.html",
            "employee_level": "Middle"
        },
        {
            "name": "Oracle Database 12c R2: Продвинутый PL/SQL",
            "description": "Трехдневный курс обучает слушателей продвинутым возможностям PL/SQL для проектирования и настройки PL/SQL на эффективное взаимодействие с базой данных и прочими приложениями. Инструкторы-эксперты авторизованного центра Oracle помогут слушателям исследовать продвинутые возможности разработки программ, пакетов, курсоров, продвинутых методов взаимодействия и коллекций.",
            "source": "https://www.masterlab.ru/course/oracle/9562.html",
            "employee_level": "Senior"
        },
        {
            "name": "Microsoft Access",
            "description": "Бесплатный и доступный онлайн-курс \"Microsoft Access\". Пройдя данный курс, вы сделаете первый шаг к серьезному обучению и сможете чётко определиться с направлением ваших интересов!",
            "source": "https://acadpc.ru/course/microsoft-access/",
            "employee_level": "Junior"
        },
        {
            "name": "Курсы SQL Server",
            "description": "В процессе обучения SQL Server Вы узнаете как использовать такие функции, как поддержка «горячего» добавления процессора (Hot Add CPU), инструмент Resource Governor, сжатие данных, «прозрачное» шифрование данных, управление на основе политик и сбор изменений данных и многое другое.",
            "source": "https://www.specialist.ru/product/sql-server-courses",
            "employee_level": "Junior"
        },
        {
            "name": "Figma",
            "description": "Курс разработан так, что вы изучаете Figma сразу в процессе рисования дизайна. Так, шаг за шагом, вы на практике ознакомитесь с полным функционалом Figma и сможете положить работу в портфолио.",
            "source": "https://contented.ru/edu/figma",
            "employee_level": "Junior"
        },
        {
            "name": "RabbitMQ: Концепции очереди сообщений от начала до конца",
            "description": "RabbitMQ с асинхронным обменом сообщениями. Концепции AMQP, Маршрутизация, Администрирование, Регистрация и примеры клиентов в Python и C#.",
            "source": "https://coursehunter.net/course/rabbitmq-koncepcii-ocheredi-soobshcheniy-ot-nachala-do-konca",
            "employee_level": "Senior"
        },
        {
            "name": "Курсы Zend Framework с созданием блога",
            "description": "Чему вы научитесь: Теоретические знания для работы с Zend Framework 2; Разрабатывать профессиональные приложения; Создавать корпоративные архитектуры; Умело работать с базами данных; Создавать системы входа",
            "source": "https://inbenefit.com/курсы-zend-framework/",
            "employee_level": "Junior"
        },
        {
            "name": "Уроки Kotlin",
            "description": "В ходе курса вы изучите язык программирования Kotlin, а также научитесь использовать его для построения Андроид программ. Вы обучитесь всем ключевым моментам работы с Kotlin и сможете выполнить легкий переход от Java к Kotlin.",
            "source": "https://itproger.com/course/kotlin",
            "employee_level": "Senior"
        },
        {
            "name": "Полное руководство по Elasticsearch",
            "description": "Изучите Elicsearch с нуля и заложите основу для изучения стека ELK (Elasticsearch, Logstash и Kibana). Вы хотите узнать популярный поисковый движок Elasticsearch с самого начала и стать профессионалом в кратчайшие сроки? Этот курс является отличным способом для быстрого изучения Elasticsearch и для того, чтобы ваши знания работали всего за несколько часов! Если это так, то вы пришли в нужное место, так как это самый полный курс по Elasticsearch, который вы найдете в Интернете!",
            "source": "https://coursehunter.net/course/polnoe-rukovodstvo-po-elasticsearch",
            "employee_level": "Senior"
        },
        {
            "name": "Курс WordPress – с нуля до Профи!",
            "description": "Курс для тех, кто хочет быстро научиться делать крутые сайты, управлять ими и продвигать их. Научившись использовать возможности самой популярной в мире CMS, вы сможете не только создавать сайты с нуля для себя и/или на заказ, но и зарабатывать на поддержке уже существующих проектов. Веб-мастера умеющие работать на WordPress востребованы на рынке труда.Курс WordPress – с нуля до Профи!",
            "source": "https://beonmax.com/courses/wordpress",
            "employee_level": "Junior"
        },
        {
            "name": "Apache CouchDB for Developers",
            "description": "Adobe CouchDB - это масштабируемая, отказоустойчивая и схематическая документально-ориентированная база данных, написанная в Erlang Он используется в крупных и малых организациях для различных приложений, где традиционная база данных SQL не является лучшим решением проблемы Аудитория Этот курс предназначен для инженеров и разработчиков, стремящихся развернуть и разработать с помощью экземпляра CouchDB",
            "source": "https://www.nobleprog.ru/cc/couch",
            "employee_level": "Junior"
        },
        {
            "name": "Начало работы с Amazon DynamoDB",
            "description": "Пройдите этот бесплатный курс, чтобы изучить основы DynamoDB и узнать, чем она отличается от традиционных систем управления реляционными базами данных. Благодаря контролируемому туру и практическим занятиям с практическими примерами вы ознакомитесь с концепциями, предназначенными для всех уровней навыков, даже если вы полный новичок в вопросе разработки баз данных. Изучив этот курс, вы получите навыки и знания, необходимые для создания масштабируемых высокопроизводительных приложений, использующих DynamoDB.",
            "source": "https://aws.amazon.com/ru/dynamodb/getting-started/",
            "employee_level": "Middle"
        },
        {
            "name": "Введение в ASP.NET Core 2.1 MVC",
            "description": "Чему вы научитесь: Научитесь разрабатывать веб-приложения с использованием ASP NET Core MVC; Узнаете новые возможности ASP NET Core MVC; Получить первое представление об архитектуре ASP NET Core MVC; Научитесь создавать модель, контроллеры и представления; Научитесь строить формы обратной связи и проверять вводимые пользователем данные",
            "source": "https://www.udemy.com/course/aspnet-core/",
            "employee_level": "Junior"
        },
        {
            "name": "API. Основы работы.",
            "description": "Это курс по основам работы с API.",
            "source": "https://webkyrs.info/category/api-osnovy-raboty",
            "employee_level": "Junior"
        },
        {
            "name": "Symfony. Создание API-платформы.",
            "description": "В этом видеокурсе вы узначете о Бэме все. Мы пройдемся по таким важным вопросам как: БЭМ и верстка; Файловая система; Сборка БЭМ-проекта; БЭМ и шаблонизация; БЭМ и JavaScript; bem-components; Библиотеки блоков.",
            "source": "https://webkyrs.info/category/symfony-sozdanie-api-platformy",
            "employee_level": "Middle"
        },
        {
            "name": "БЭМ-платформа",
            "description": "В этом видеокурсе вы узначете о Бэме все. Мы пройдемся по таким важным вопросам как: БЭМ и верстка; Файловая система; Сборка БЭМ-проекта; БЭМ и шаблонизация; БЭМ и JavaScript; bem-components; Библиотеки блоков.",
            "source": "https://coursehunter.net/course/bem-platform",
            "employee_level": "Junior"
        },
        {
            "name": "UX/UI дизайнер",
            "description": "Научитесь разрабатывать интерфейсы, решающие задачи бизнеса; Пройдите все этапы разработки дизайна продукта с нуля; Освойте веб- и мобильный дизайн, проектирование и UX‑аналитику.",
            "source": "https://netology.ru/programs/product-design",
            "employee_level": "Middle"
        },
        {
            "name": "Уроки по C# и платформе .NET Framework",
            "description": "Описание базовых синтаксических конструкций языка C# и основ ООП",
            "source": "https://professorweb.ru/",
            "employee_level": "Middle"
        },
        {
            "name": "Adobe Illustrator",
            "description": "За пять дней обучения вы научитесь создавать векторную графику и поймете, как работает Adobe Illustrator. Вы сможете легко планировать сложную работу, разделять ее на этапы и браться за реальные заказы — логотипы, фирменные стили, пиктограммы, плакаты, упаковку и рекламный дизайн. В процессе обучения инструктор покажет вам множество примеров и секретов Illustrator, поделится уникальным накопленным опытом, помогая избежать распространенных ошибок.",
            "source": "https://realtime.ru/courses/kursy-adobe-illustrator-cs-professional",
            "employee_level": "Middle"
        },
        {
            "name": "Интенсив по RxJS",
            "description": "За время нашей встречи мы детально изучим реальное использование RxJS, на практике посмотрим как решать типичные проблемы. Познакомимся с концепцией реактивного программирования, разберем самые популярные операторы, научимся управлять потоками и тестировать их. И все это - на практических задачах, в которых будем использовать RxJS.",
            "source": "https://learn.javascript.ru/courses/rxjs",
            "employee_level": "Middle"
        },
        {
            "name": "React Native 2020. Мобильные приложения на JavaScript",
            "description": "Чему вы научитесь: Создавать мобильные приложения под iOS и Android на языке JavaScript; React Native на практике; Создадите несколько приложений в течении курса; Получите много опыта и Best Practices в React.",
            "source": "https://www.udemy.com/course/react-native-complete-guide",
            "employee_level": "Middle"
        },
        {
            "name": "DevOps Старт!",
            "description": "Если Вы только задумываетесь о карьере DevOps специалиста и делаете первые шаги в этом направлении, приглашаем пройти  наш бесплатный курс для начинающих ! У Вас будет возможность задать свои вопросы профессиональным DevOps инженерам из ведущих компаний России, познакомиться с актуальными инструментами и технологиями, понять основы и философию DevOps!",
            "source": "https://devops-school.ru/devops_free.html",
            "employee_level": "Middle"
        },
        {
            "name": "Stylus: быстрый старт",
            "description": "На мастер-классе мы рассмотрим: особенности препроцессора, отличия от sass/less, простоту сборки.",
            "source": "https://geekbrains.ru/events/628",
            "employee_level": "Middle"
        },
        {
            "name": "Фреймворк NuxtJS",
            "description": "Полный охват теоретических и практических знаний с полным циклом разработки: клиентская и серверная части; Nuxt.js позволяет создавать SEO-дружественные приложения, которые можно продвигать в поисковых системах; По урокам курса создайте с нуля универсальное SPA-приложение и поместите его в портфолио; Создание и настройка SSR-приложений занимает много времени. Nuxt позволяет крайне просто создавать универсальные приложения.",
            "source": "https://cpsell.ru/pproducts/webformyself/disc18.htm",
            "employee_level": "Middle"
        },
        {
            "name": "Entity Framework",
            "description": "В этом курсе вы научитесь: Подключать EF к проекту; Использовать различные нотации EntityFramework(Code First, Model First, DataBase First); Запросы к базе данных с помощью EntityFramework; Добавление, изменение, удаление данных из базы по средствам EntityFramework.",
            "source": "https://brainoteka.com/courses/entity-framework",
            "employee_level": "Senior"
        },
        {
            "name": "Основной курс по Joomla 3.9",
            "description": "Joomla позволяет разработчикам быстро создавать качественные сайты, используя привычный язык программирования. Ее выбирают как начинающие, так и профессионалы, ведь каждому доступен минимальный набор инструментов и возможность добавлять необходимые компоненты для администрирования.",
            "source": "https://info-hit.ru/course-osnovnoy-kurs-po-joomla-3-9",
            "employee_level": "Middle"
        },
        {
            "name": "Основы Hibernate для начинающих",
            "description": "Вы получите фундаментальные знания по Hibernate/JPA, которые затем можно будет применять в любом типе проектов (веб, десктоп). Без этих знаний идти дальше смысла нет, т.к. у вас не будет фундамента. Вы будете выполнять последовательно несложные шаги и получать результат, т.к. курс рассчитан как раз для новичков.",
            "source": "https://coursehunter.net/course/osnovy-hibernate-dlya-nachinayushchih",
            "employee_level": "Senior"
        },
        {
            "name": "AWS - С Нуля до Профессионала",
            "description": "Чему вы научитесь: Получат хорошую подготовку к сертификационным экзаменам AWS; Смогут использовать очень многие сервисы AWS для поднятия простых и сложных инфраструктур; Автоматизировать Deployment программ; Заниматься поддержкой инфраструктуры AWS; Изменять инфраструктуру AWS.",
            "source": "https://www.udemy.com/course/russian-aws",
            "employee_level": "Senior"
        },
        {
            "name": "Профессия Go-разработчик",
            "description": "Вы освоите востребованную профессию с нуля: поймёте принципы работы с операционными системами и обменом данными, научитесь создавать и оптимизировать приложения на языке Go. Сможете начать карьеру программиста.",
            "source": "https://skillbox.ru/course/profession-godev",
            "employee_level": "Junior"
        },
        {
            "name": "Основы Apache Kafka",
            "description": "Вы научитесь: Выполнять основные команды по настройке и администрированию сервера Apache Kafka; Создавать распределенные приложения для обмена сообщениями; Выполнять публикацию и прием сообщений с использованием Kafka Streams API; Использовать язык DSL для настройки потоков данных.",
            "source": "https://www.specialist.ru/course/kafka",
            "employee_level": "Senior"
        },
        {
            "name": "Kubernetes База",
            "description": "Практический курс для тех, кто не знает Kubernetes, но хочет с ним познакомиться в комфортном для себя режиме и начать работать.",
            "source": "https://slurm.io/slurm_online",
            "employee_level": "Senior"
        },
        {
            "name": "Unit тестирование в Java с JUnit",
            "description": "Чему вы научитесь на данном курсе: Уверенно использовать фреймворк JUnit как в 5-й, так и в 4-й версии для модульного тестирования своих продуктов; Правильно и понятно именовать методы для тестирования; Понимать и уметь применять методы класса Assertions; Выполнять тесты в определенном порядке с помощью аннотации @FixMethodOrder; Запускать несколько тестовых классов одновременно; Параметризировать и группировать ваши тесты по категориям; Проводить миграцию ранее написанного кода с Junit 4 на JUnit 5.",
            "source": "https://itvdn.com/ru/video/junit",
            "employee_level": "Senior"
        },
        {
            "name": "Бесплатный курс по SVG",
            "description": "Бесплатный интерактивный курс по SVG познакомит вас с основами векторной графики и поможет разобраться с базовыми понятиями: линиями, прямоугольниками, окружностями. Вы научитесь позиционировать, управлять цветом и размерами, собирать разные рисунки. А также сможете оформить SVG-фигуры с помощью заливок и обводок.",
            "source": "http://htmlbook.ru/blog/besplatnyy-kurs-po-svg",
            "employee_level": "Senior"
        },
        {
            "name": "Начало работы с WPF. Visual Studio",
            "description": "Цель курса — теоретическое и практическое знакомство с синтаксисом языка XAML, структурой разметки и работу с разметкой в среде Visual Studio. Курс закладывает достаточный уровень владения технологий WPF для создания клиентских приложений использующих привязку к данным, мультимедиа средства и анимацию на базе .Net Framework 4.0.",
            "source": "https://stepik.org/course/1676/promo",
            "employee_level": "Junior"
        },
        {
            "name": "Visual Studio 2019 Tips & Tricks",
            "description": "Чему вы научитесь на данном курсе: Устанавливать и настраивать Visual Studio с необходимыми для работы компонентами; Настраивать внешнее оформление IDE Visual Studio под свои потребности; Использовать широкий перечень горячих клавиш и клавиатурных сокращений; Применять популярные предустановленные сниппеты и создавать их самостоятельно; Использовать в процессе разработки средства анализа кода Visual Studio; Уметь использовать средства работы с Unit-тестами; Применять встроенные в среду механизмы отладки; Использовать в работе механизмы совместной разработки (Team Explorer, CI / CD, Live Share).",
            "source": "https://itvdn.com/ru/video/vs19",
            "employee_level": "Junior"
        },
        {
            "name": "Основы Nginx: Высокопроизводительные серверы с нуля (Часть 1 из 2)",
            "description": "После прохождения курса у вас будет достаточно навыков для того, чтобы запустить безопасный высокопроизводительный веб-сервер и улучшить существующие решения с которыми вы уже работаете.",
            "source": "https://openssource.biz/osnovy-nginx-vysokoproizvoditelnye-servery-s-nulya-chast-1-iz-2.html",
            "employee_level": "Middle"
        },
        {
            "name": "Изучаем Dart",
            "description": "Чему вы научитесь: Вы научитесь программировать на Dart; Сможете создавать мобильные приложения на платформе Flutter, используя Dart.",
            "source": "https://www.udemy.com/course/learndart",
            "employee_level": "Senior"
        },
        {
            "name": "Видеокурс по GraphQL",
            "description": "Во время курса вы изучите все темы, начиная от глубокого сравнения технологий GraphQL и Rest, разберётесь с синтаксисом GraphQL, узнаете почему это технология будущего. Мы научим вас применять GraphQL вместе с React, используя библиотеку Apollo.",
            "source": "https://coursehunter.net/course/videokurs-po-graphql",
            "employee_level": "Middle"
        },
        {
            "name": "Photoshop с нуля до PRO",
            "description": "Вы освоите самый популярный графический редактор. Научитесь профессионально работать с графикой, создавать коллажи и анимацию и сможете начать карьеру в дизайне.",
            "source": "https://skillbox.ru/course/photoshoppro",
            "employee_level": "Middle"
        },
        {
            "name": "Настройка и администрирование jira Software, настройка функциональности для работы по Scrum и Kanban",
            "description": "Курс предназначен для слушателей, готовящихся к работе с Atlassian Jira Software и не имеющих опыта работы с системами управления задачами.Предлагаемый курс разбит на две части: Обзор пользовательского функционала и администрирование Atlassian Jira Software",
            "source": "https://www.itexpert.ru/rus/services/training/moscow/detail.php?ID=10727",
            "employee_level": "Junior"
        },
        {
            "name": "БАЗОВЫЙ КУРС ПО PHOTOSHOP",
            "description": "На курсе вы научитесь создавать продающие баннеры для своих проектов, которые будут привлекать внимание к вашему продукту и увеличивать продажи.Также вы научитесь лучше формировать технические задания для специалистов в области графического дизайна",
            "source": "https://course.minimal-agency.ru/photoshop",
            "employee_level": "Junior"
        },
        {
            "name": "Курс agile scrum. Курс agile. Курс scrum Управление проектом",
            "description": "В этом курсе вы изучите методологию Agile и ее фреймворк Scrum для того что бы внедрить в свой бизнес либо жизнь.",
            "source": "https://www.udemy.com/course/agile_scrum",
            "employee_level": "Middle"
        },
        {
            "name": "Управление по Agile: Scrum, Kanban, Lean",
            "description": "Курс поможет узнать о видах agile-подходов, попробовать работать с продуктовым подходом, а не с проектным, перестать тратить время на текучку, бесконечные встречи и совещания. Обеспечить максимальную прозрачность при работе с заказчиком и создать доверительные отношения. Избежать микроменеджмента и дать команде возможность улучшать свою работу.",
            "source": "https://netology.ru/programs/agile-for-all",
            "employee_level": "Senior"
        },
        {
            "name": "XML и XSLT. Современные технологии обработки данных для ВЕБ",
            "description": "XML — это невероятно мощные технологии представления любых данных. С помощью XML описывают и представляют документы (офисные документы, книги, счета, платежки и др.), XML часто используется для обмена данными в программировании, для передачи информации в вебе. Вы освоите основные технологии XML, такие как описание данных, грамматика XML-разметки, XML схемы, XSL и XSLT (преобразования XML документов), а также возможности работы с XML, доступные в Microsoft Office.",
            "source": "https://www.specialist.ru/course/khml-a",
            "employee_level": "Middle"
        },
        {
            "name": "XML Fundamentals",
            "description": "Курс XML Fundamentals посвящен основам XML. В течение 2 дней вы познакомитесь с основами XML технологии, включая написание правильного и валидного XML, создания Document Type Definitions (DTDs) и XML-схем документов и использование XPath and XQuery.",
            "source": "https://edu.fors.ru/raspisanie-kursov/kurs/6584/",
            "employee_level": "Junior"
        },
        {
            "name": "CI/CD",
            "description": "Курс как для разработчиков, так и для администраторов, отвечающих за настройку процессов непрерывной разработки и доставки (continuous integration / continuous delivery)",
            "source": "https://otus.ru/lessons/cicd/",
            "employee_level": "Junior"
        },
        {
            "name": "RubyGarage: Курсы по Ruby/Rails",
            "description": "Курс создан для тех, кто хочет освоить профессию 'WEB разработчик'. Цель курса — дать участникам необходимый уровень знаний и навыков, когда их можно будет смело брать на работу. Программа курса основана на требованиях работодателей и сфокусирована на процессах, подходах и лучших практиках опытных разработчиков. Основная наша задача — научить участников создавать качественные WEB-приложения на базе Ruby on Rails, привить лучшие практики и культуру разработки.",
            "source": "https://rubycourses.ru/courses/41",
            "employee_level": "Junior"
        },
        {
            "name": "Thinknetica: Профессиональная разработка на Ruby on Rails",
            "description": "Главная цель курса - дать участникам такой уровень знаний и навыков, когда их можно будет смело брать на работу. Мы ставим перед собой задачу научить создавать качественные протестированные веб-приложения, привить лучшие практики и культуру разработки на Ruby on Rails.",
            "source": "https://rubycourses.ru/courses/11",
            "employee_level": "Middle"
        },
        {
            "name": "Хороший программист: Интенсив Ruby on Rails",
            "description": "За 4 с половиной месяца с нуля проходим Ruby и учим веб-разработке на Ruby on Rails.Вы научитесь программировать на Ruby, самостоятельно с нуля создавать сложные веб-приложения на Ruby on Rails, поймете как устроен интернет, изучите азы HTML, CSS, JavaScript, научитесь пользоваться Git и настраивать сервера Linux для выкладывания приложений в интернет.В конце курса поможем оформить портфолио и научим искать работу. Видео, домашние задания с проверкой, вебинары, отдельный чатик с преподами.",
            "source": "https://goodprogrammer.ru/rails",
            "employee_level": "Senior"
        },
        {
            "name": "Программист С++",
            "description": "C++-разработка входит в топ-10 востребованных IT-профессий, по данным HeadHunter. Чтобы освоить популярную специальность, вам будет достаточно школьных знаний. Вы разберётесь в языке программирования, на котором создаются десктопные приложения, утилиты, сервисы для Linuх, браузеры Google Chrome и Firefox и все высоконагруженные системы.",
            "source": "https://geekbrains.ru/professions/cpp",
            "employee_level": "Junior"
        },
        {
            "name": "Профессия Разработчик на C++ с нуля",
            "description": "Получите профессию разработчика на C++: вы научитесь понимать принципы разработки, писать код, использовать сторонние инструменты и разбираться в документации.",
            "source": "https://skillbox.ru/course/profession-c-plus-plus/",
            "employee_level": "Junior"
        },
        {
            "name": "Познайте искусство С++  со специалистами Яндекса и МФТИ",
            "description": "Программа курса состоит из пяти онлайн-курсов, каждый длится не более шести недель. Слушателю предстоит чередовать просмотр коротких видео с решением практических заданий. В курс включены как задачи и тесты, необходимые для получения сертификата, так и дополнительные необязательные задачи — для тех, кто хочет потренироваться побольше. Последняя неделя каждого курса посвящена решению финальной задачи.",
            "source": "https://yandex.ru/promo/academy/cpp_course",
            "employee_level": "Middle"
        },
        {
            "name": "Flutter уроки От идеи до приложения",
            "description": "Данный ресурс посвящен разработке мобильных приложений с помощью Flutter SDK.",
            "source": "https://flutter.su/",
            "employee_level": "Junior"
        },
        {
            "name": "Flutter",
            "description": "Вы научитесь создавать кроссплатформенные приложения, использующие одну и ту же кодовую базу для iOS и Android. С помощью фреймворка Flutter и языка Dart сможете вырасти как мобильный разработчик.",
            "source": "https://skillbox.ru/course/flutter/",
            "employee_level": "Middle"
        },
        {
            "name": "ES5 руководство по JavaScript",
            "description": "С помощью советов предложенных в данном руководстве вы будете писать код, понятный любой команде разработчиков.",
            "source": "https://habr.com/ru/post/281110/",
            "employee_level": "Junior"
        },
        {
            "name": "Babel JS из ES6 в стандарт ES5",
            "description": "Курс состоит из 7 видео-уроков, включающих баховые знания по использованию Babel.",
            "source": "https://showskills.ru/it/developer/Frontend-Middle/42-babel-js-iz-es6-v-standart-es5.html",
            "employee_level": "Junior"
        },
        {
            "name": "Babel",
            "description": "Официальная документация",
            "source": "https://babeljs.io/docs/en/index.html",
            "employee_level": "Middle"
        },
        {
            "name": "PostCSS",
            "description": "Бесплатный и доступный онлайн-курс \"PostCSS\". Пройдя данный курс, вы сделаете первый шаг к серьезному обучению и сможете чётко определиться с направлением ваших интересов! Вы также бесплатно сможете изучить другие интересные онлайн курсы. Регистрируйтесь и получайте знания совершенно бесплатно.",
            "source": "https://acadpc.ru/course/postcss/",
            "employee_level": "Junior"
        },
        {
            "name": "Postcss от mooc",
            "description": "Курс \"PostCSS\", созданный для веб-разработчиков, предоставляет возможность овладеть замечательным инструментом программирования, который станет незаменимым помощником. 8 уроков (45 мин), посвящённые изучению и практическому применению PostCSS, раскроют основной потенциал программы программирования. Учебной программой предусматриваются мини-консультации в виде ответов на вопросы обучающихся. По непонятным моментам ученики уведомляют преподавателя в комментариях к видеоуроку. Выпускники научатся основам работы с PostCSS и создавать плагины",
            "source": "https://mooc.ru/courses/znakomimsya-s-postcss-loftblog",
            "employee_level": "Junior"
        },
        {
            "name": "Тестирование с Jest",
            "description": "Этот курс посвящен Jest, великолепному набору для тестирования JavaScript. Многие крупные игроки полагаются на Jest сегодня. Некоторые из них - Facebook, New York Times, Twitter, Spotify, Instagram и Airbnb. Jest чрезвычайно эффективен и прост в работе. К концу этого курса вы узнаете, как установить Jest в свои проекты и быть готовым проверить свой код с поддержкой современного JavaScript.",
            "source": "https://coursehunter.net/course/testirovanie-s-jest",
            "employee_level": "Middle"
        },
        {
            "name": "Jest",
            "description": "Официальная документация",
            "source": "https://jestjs.io/ru/",
            "employee_level": "Junior"
        },
        {
            "name": "Курсы TCP/IP",
            "description": "Вы научитесь разрабатывать сети на базе TCP/IP и управлять ими, идентифицировать компоненты сетевой инфраструктуры, осуществлять мониторинг и анализировать производительность сети. Курс TCP/IP также будет полезен тем, кто хочет их систематизировать свои знания и повысить свою эффективность за счёт новых приёмов и методов работы.",
            "source": "https://www.specialist.ru/dictionary/definition/tcp-ip",
            "employee_level": "Senior"
        },
        {
            "name": "Детальный разбор AWS Lambda",
            "description": "Все больше людей переходят на AWS Lambda ради масштабируемости, производительности, экономии и возможности обрабатывать миллионы и даже триллионы запросов в месяц. Для этого не нужно управлять инфраструктурой, на которой работает сервис. А автомасштабирование позволяет обслуживать тысячи одновременных запросов в секунду.",
            "source": "https://habr.com/ru/company/otus/blog/466519/",
            "employee_level": "Senior"
        },
        {
            "name": "Руководство по NoSQL для разработчиков",
            "description": "В этой статье я расскажу, почему вообще были созданы базы данных NoSQL, какие задачи они решают и почему вдруг необходимо так много различных баз данных.",
            "source": "https://javarush.ru/groups/posts/467-rukovodstvo-po-nosql-dlja-razrabotchikov-",
            "employee_level": "Middle"
        },
        {
            "name": "Урок Mercurial - полный цикл использования",
            "description": "В уроке рассмотрено знакомство с системой управления кодом Mercurial - обзор и описан основной цикл работы. Будет полезно тем, кто хочет познакомиться с системой и на примере понять, как происходит работа с ней.",
            "source": "https://www.youtube.com/watch?v=wgGZ_I9md7w",
            "employee_level": "Senior"
        },
        {
            "name": "Основы микросервисов",
            "description": "Этот курс охватывает фундаментальные концепции микросервисов, чтобы помочь вам определить, подходит ли эта архитектурная модель для вас и вашей команды.",
            "source": "https://coursehunter.net/course/osnovy-mikroservisov",
            "employee_level": "Senior"
        },
        {
            "name": "Введение в Scala",
            "description": "Изучение Scala будет полезно тем, кто в будущем хочет: 1. Писать в функциональном стиле. 2. Писать код для клиента веб-приложения. 3. Создавать код асинхронных веб-серверов. 4. Заниматься анализом больших данных. 5. Создавать распределенные системы",
            "source": "https://stepik.org/course/16243/promo",
            "employee_level": "Junior"
        },
        {
            "name": "Основы LINQ",
            "description": "Вы начнете с демонстрации возможностей LINQ вместе с некоторыми важными функциями языка C # для LINQ, в том числе с тем, как создавать и использовать методы расширения и лямбда-выражения. Далее вы сосредоточитесь на поведении запросов LINQ и начнете работать с реалистичными данными, чтобы научиться фильтровать, упорядочивать и проектировать данные.",
            "source": "https://coursehunter.net/course/osnovy-linq",
            "employee_level": "Senior"
        },
        {
            "name": "Spring Boot",
            "description": "Spring Boot предлагает инновационный подход к созданию приложений Spring. С помощью Spring Boot разработчики могут легко создавать Spring-проекты, которые используют различные модули под Spring-зонтиком. Этот новый инструмент от Pivotal упрощает использование Spring Framework за счет автоматической настройки. В этом курсе ветеран-разработчик программного обеспечения Кевин Бауэрсокс (Kevin Bowersox) с легкостью обучает Spring Boot, помогая начинающим разработчикам промежуточных Java-приложений разгадать истинный потенциал Spring Framework.",
            "source": "https://coursehunter.net/course/oreilly-getting-started-with-spring-boot",
            "employee_level": "Senior"
        },
        {
            "name": "Интенсив-курс по Asterisk",
            "description": "Цель курса: Научиться строить системы телефонии корпоративного сегмента; Научиться реализовывать интересные IT-проекты, связанные с реальным миром; Повысить свою стоимость на рынке труда; Отличиться перед коллегами знаниями крутой IT-системы; Поддерживать свою компетенцию в актуальном состоянии.",
            "source": "https://www.infosystems.ru/courses/asterisk/intensiv_kurs_po_asterisk/",
            "employee_level": "Middle"
        },
        {
            "name": "Базовый курс английского языка с нуля (для новичков)",
            "description": "Мой курс позволит заложить необходимый базис (основу) для дальнейшего изучения более сложных материалов. Курс отличается от других курсов по изучению Английского Языка. Это не обычное озвучивание презентаций, а обучение с преподавателем на интерактивной доске - Вы будете видеть, что я пишу, о чем в конкретный момент идет речь. Люди делятся на типы по тому, как они воспринимают информацию, больше глазами или больше ушами. Данный курс подойдет и для аудиалов и для визуалов.",
            "source": "https://www.udemy.com/course/anglijskij-yazyk-dlya-nachinayushchih-s-nulya",
            "employee_level": "Junior"
        },
        {
            "name": "React + mobx путь с нуля. Mobx + react, взгляд со стороны",
            "description": "Курс посвящен совместному использованию React и mobx. Mobx преднозначен для реализации бизнес логики.",
            "source": "https://habr.com/ru/post/324388/",
            "employee_level": "Middle"
        }
    ]
}
